public/math/mathematics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../subjects.html">Subjects</a> &gt;
</p>
<div id="outline-container-org511f9e4" class="outline-2">
<h2 id="org511f9e4">Mathematics</h2>
<div class="outline-text-2" id="text-org511f9e4">
<p>
One of the things I am more grateful for to university is getting me
introduced to the ideas of Mathematics. During high school, I had math
as one of the primary subjects, we went through the basics of algebra
and calculus up until integrals. In university the pace changed, and I
noticed I was not used to <b>thinking</b> about math.
</p>

<p>
Up until my last year of bachelor, math was all about a lot of
exercises, memorizing formulas and "pattern match" problems. This was
how I was taught for my entire life and it took me a great effort and
time to leave this mentality.
</p>

<p>
At my last year I finally began developing a kind of maturity for math
and only then I really started enjoying it. It surely requires a lot
of thinking and intellectual effort but I find it rewarding, here I
will document my journey in the realm of mathematics.
</p>

<p>
&#x2013; <a href="notes.html">notes</a> - <a href="../feeds/feedMath.rss">RSS feed</a> -
</p>

<hr />

<p>
Travel: <a href="../subjects.html">Subjects</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
